# -*- coding: utf-8 -*-
from bs4 import BeautifulSoup
import requests

requests.packages.urllib3.disable_warnings(requests.packages.urllib3.exceptions.InsecureRequestWarning)
#첫번쨰 제품부터 꼭 들어가야할 키워드를 적어준다
coffee_manual_keyword= [["프렌치카페", "카페믹스"], ["네스카페", "수프리모", "골드", "마일드"], [ "모카", "골드", "마일드"], ["화이트", "골드"], ["맥심", "카누", "미니"], ["카누", "바닐라", "라떼"], ["커피빈", " 캡틴", "아메리카노", "미니"], ["인터내셔널", "로스트", "커피스틱"], ["커클랜드", "콜롬비아", "그라운드"], ["커클랜드", "에티오피아", "원두커피"], ["커클랜드", "에스프레소"], ["커클랜드", "하우스", "블렌드"], ["테라로사", "올데이", "블렌드"], ["룰리", "스페셜", "블랙원두커피"], ["커클랜드", "콜롬비아", "원두", "커피"], ["폴바셋", "시그니처", "블렌드"], ["커피명가", "올굿", " 블렌드"], ["스타벅스", "카페", "베로나"], ["스타벅스", "브렉퍼스트", "블렌드"], ["스타벅스", "by" ], ["스타벅스", "네스카페", "돌체", "캡슐"], ["best", "moment", "돌체", "호환", "캡슐"], ["네스카페", "돌체구스토", "멀티팩", "캡슐"]]
#27 ~ 54
cleaner_mannual_keyword = [["다우니", "에이프릴", "4.88"], ["르샤트라", "피오니", "2"],["다우니", "블리스", "3.4"],["커클랜드", "라벤더", "5.53"],["커클랜드", "후레쉬", "5.53"],
                           ["샤프란", "꽃담초", "5.7"],["옐로우", "가든", "5"],["프레쉬", "아우라", "200"],["커클랜드", "종이형", "250"],["다우니", "언스탑", "1060"],
                           ["다우니", "실내건조", "섬유유연제", "4"],["리큐", "세제", "4.5"],["다우니", "실내건조", "세탁세제", "2.7"],
                           ["다우니", "품형", "실내건조", "32"],["울샴푸", "4.5"],["커클랜드", "울트라", "클린", "3.6"],
                           ["커클랜드", "울트라","클린", "5.73"],["엑츠", "데오", "후레쉬","3.5"],["커클랜드", "복합", "고농축", "12.7"],
                           ["홈워시", "홈드라이", "1.5"],["라브르베르", "섬유찌든", "740"],["퍼실", "어드밴스드", "젤", "4"],["시트형", "파워업", "세제", "120"],
                           ["슈가버블", "세탁", "7"],["비트", "세탁", "7"],["넬리", "소다", "3.29"]]

chocolate_mannual_keyword = [["트러플", "2"], ["다크스퀘어","543"], ["토피", "1.25"], ["커클랜드", "초콜릿", "월드", "907"], ["동전", "1250"], ["카카오", "100"], ["구미", "561"], ["아몬드", "1.36"], ["해바라기", "700"], ["핫초콜", "500"],
                     ["밀펑", "16"],["틴스", "125"], ["누텔라앤", "12"], ["킨더조이", "12"], ["킨더맥시", "36"]]

chocolate_mannual_keyword2 = [ ["킨더부에노", "645"], ["엠엔엠", "1587"], ["펀사이즈", "1361"],['미니스','1745'], ["믹스드", "1134"], ["트윅스", "1875"],
                     ["몰티", "720"], ["큐브", "608"], ["미니어", "1.58"], ["너겟", "1.47"], ["쿠키", "크림", "904"], ["리세스틴", "560"], ["믹스바", "30"], ["타이니", "656"], ["로카", "765"], ["셀렉션", "675"], ["씨쉘", "500"],
                     ["마카롱", "525"], ["박스", "200"], ["루비", "360"], ["마카다미아", "454"], ["케이크", "450"], ["미니바", "12"],["해머", "300"], ["크리스피", "1"]]


diaper_mannual_keyword = [["기저귀", "2", "160"], ["기저귀", "4", "128"], ["기저귀", "3", "156"], ["기저귀", "5", "112"], ["네이", "팬티", "4", "88"], ["네이", "팬티", "5", "72"], ["네이", "팬티", "6", "60"], ["프리미엄" , "성인", "40"],
                             ["성인", "남성", "84"], ["성인", "여성", "84"]]

oil_mannual_keyword = [["아보카도", "1"], ["올리브", "1"], ["올리브", "스프레이", "400"], ["버진" , "올리브", "3"], ["올리브", "3"], ["놀라", "2"], ["포도씨", "2"], ["해바라기", "4"], ["옥수수", "3.6"], ["참기름", "1.8"],
                  ["참기름", "2"], ["들기름", "2"], ["코코넛", "1.5"]]

bread_mannual_keyword = [["더블", "치즈", "15"], ["카스", "615"], ["치즈", "903"], ["땅콩", "20"], ["크림", "치즈", "20"], ["소프트", "40"], ["오븐", "버터", "12"], ["스콘", "12"], ["밀크", "8"],
                  ["플랫", "14"], ["보름달", "12"], ["밀식빵", "3"], ["샌드위치", "2"], ["탕종", "2"], ["호밀", "2"], ["핫도그", "15"], ["오리진", "47"], ["허니", "카스", "12"], ["브라", "65"], ["바나나", "16"], ["마", "36"],
                  ["케이크", "30"], ["도", "35"], ["미니", "25"], ["팔미", "8"], ["갈릭","크림", "6"], ["프렌치", "20"], ["미니", "버터" "32"], ["베이글", "12"], ["버라이어키", "24"], ["디너롤", "36"]]

source_mannual_keyword = [["양조", "1.8"], ["영덕", "1"], ["쯔유", "1.8"], ["간장", "1.8"], ["몽고", "송표", "4.5"], ["장아찌", "2"], ["진간장", "2"], ["사과", "식초", "3"], ["발사믹", "1"], ["깔라", "800"], ["현미", "3"],
                 ["식초", "5"], ["쌀", "올리고", "2"], ["올리고", "3"], ["청정원", "조청쌀엿", "3"], ["청정원", "순창초고추장", "1*2"], ["태양", "고추장", "2"],
                 ["만능", "양념", "2"], ["고기", "쌈", "2"], ["순창", "양념", "된장", "2"], ["연두", "4"], ["알리오", "10"], ["크림", "3"], ["로제", "10"], ["토마토", "4"], ["다시", "30"], ["토마토", "3"],
                 ["소스락", "백년", "70"], ["피클", "1.89"], ["소스락", "칼칼", "70"], ["피클", "2"], ["해물", "30"], ["올리브", "2"], ["블랙", "올리브", "6"], ["마요네즈", "골드", "3.7"], ["마요네즈", "2"], ["아보카도", "마요네즈", "710"], ["토마토", "케", "2"],
                 ["머스타드", "2"], ["토마토", "8"], ["핫소스", "355"], ["아몬드", "908"], ["파마산", "2"], ["칠리", "2"], ["와사비", "3"], ["베이컨", "567"], ["참깨", "1"], ["발사믹", "366"], ["굴소스", "3"], ["시저", "1"],
                 ["참깨", "3"], ["오리", "1"], ["바베큐", "2"], ["데리야끼", "1.26"], ["소", "2"], ["돼지", "2"], ["소금", "935"], ["계피", "303"], ["스테이크", "822"], ["후추", "399"], ["갈릭", "레이크", "600"], ["히말라야", "리필"],
                 ["후추", "357"], ["레드", "300"], ["트러플", "소금", "2"], ["월계", "45"], ["파슬리", "70"],
                 ["천일염", "2"], ["참깨", "1.2"], ["바질", "141"], ["머스타드", "845"], ["살사", "2"]]

life_object_mannual_keyword =  [["방충제", "옷장", "서랍"], ["내추리스", "라벤더", "3"], ["깨끗", "370","650"], ["퍼퓸", "3"], ["섬유", "다우니", "2"], ["퍼퓸", "150"], ["에어", "4"], ["살균", "500"], ["더블", "화장", "6"],  ["멀티", "200"],
                 ["스카치", "린트", "95"], ["테이프", "230"], ["테이프", "6"], ["변기", "레몬", "50"], ["소프트", "물티슈", "8"], ["안심", "60"], ["향균", "2"], ["깨끗", "티슈", "14"], ["욕실", "4"], ["코인", "3"], ["파이프", "5"],
                 ["베이킹", "핸들"], ["락스", "5"], ["곰팡이", "5"], ["세정제", "3"], ["세탁", "6"], ["세제", "포도", "4"], ["세제", "2"], ["세제","3"], ["애플", "세제", "4"], ["수세미", "3"], ["소다","레몬", "3"],
                 ["수세미","8"], ["세제", "자몽", "4"], ["행주", "6"], ["마미손","장갑", "대형"], ["마미손", "장갑", "중형"], ["행주", "100"]]
#
# head_object_mannual_keyword = [["페리오","히말라야핑크솔트치약", "160*5"], ["팬틴", "어드밴스드케어샴푸", "1.13"], ["팬틴", "어드밴스드케어컨디셔너", "1.13"], ["오가니스트", "샴푸까리떼", "980"], ["오가니스트", "샴푸블랙솔트", "980"], ["오가니스트", "컨디셔너까리떼", "980"],
#                 ["오가니스트", "컨디셔너","블랙솔트", "980"], ["모노티크", "샴푸", "라벤더", "1500*2"], ["비타브리드", "샴푸", "1000"], ["알페신샴푸", "375*2"], ["닥터포헤어", "폴리젠샴푸", "750*2+100"], ["닥터포헤어", "피토테라피샴푸", "750*2+100"],
#                 ["팬틴", "오일샴푸", "1.13"], ["닥터그루트", "에딕트헤어세트", "샴푸680"], ["무코타", "헤어트리트먼트", "160*2"], ["코린드팜", "2in1", "250*3"], ["실크테라피", "헤어에센스", "180+60+15"], ["헤드스파7", "파란눈블랙헤어팩", "300*2+35"],
#                 ["실크테라피", "샤인트리트먼트", "500+100"], ["우르오스", "바디클렌저", "500"], ["커클랜드", "바디워시","800*2"], ["세타필", "바디워시", "1000"], ["모노티크", "바디워시", "1500*2"], ["온더바디스크럽", "바디워시", "블랙로즈", "600*2"],
#                 ["온더바디스크럽", "바디워시", "히말라야", "600*2"], ["뉴트로지나", "레인바스샤워젤", "1182"], ["말랑이", "버블핸드워시", "500*2+450*3"], ["아비노", "바디워시", "1000"], ["카오", "화이트솝", "12"],
#                 ["커클랜드", "바디솝", "15"], ["오스트레일리안", "보태니컬비누", "200*8"], ["글락소스미스", "센소다인", "100*5"], ["콜게이트", "그레이트레귤러", "250*5"], ["파로돈탁스", "치약", "100*6"],
#                 ["레드씰", "어린이치약", "75*4"], ["레드씰", "프로폴리스", "160*4"], ["리치", "키즈칫솔", "8"], ["리치","키즈칫솔", "유아", "8"], ["오랄비", "9000엑스퍼트", "7"], ["오랄비", "프로플렉스", "6"], ["오랄비","치간칫솔", "20*3"],
#                 ["검", "치간칫솔", "80*3"], ["플렉커스", "어린이", "치실", "75*3"], ["가그린", "제로오리지널", "1350*2+750"], ["오랄비", "글라이드", "민트향", "44*6"], ["글락소스미스", "폴리덴트", "의치세정제", "108"],
#                 ["리스테린", "그린티", "1.5*2"], ["리스테린", "헬시브라이트", "1.5*2"], ["리스테린", "쿨민트", "1.5*2"], ["피지오겔", "dmt", "200*2"], ["버츠비", "립밤", "5"], ["히말라야", "너리싱", "크림", "200*2"],
#                 ["피지오겔", "바디로션", "400*2"], ["바이오더마", "아토덤", "500*2"], ["라운드랩", "독도토너", "350*2"], ["라운드랩", "독도클렌저", "150*2+40"], ["닥터브로너스", "오가닉스킨소프트너", "475"],
#                 ["뉴트로지나", "딥클린", "클렌저", "175*2+100"], ["시세이도", "센카", "클렌저", "120*3+40"], ["참존", "징코", "클렌징티슈", "70*2+10"]]
# #
# snack_mannual_keyword = [["프리토레이", "버라이어티", "878"], ["팝코너스", "칩", "28*24"], ["마마스초이스", "닭가슴살칩", "30*7"], ["커클랜드", "핑크솔트", "감자칩","907"], ["프리토레이", "레이즈", "425"], ["신화당", "오란다", "175*12"],
#                 ["리츠", "크래커", "1.74"], ["뚜부", "크래커", "50*7"], ["프리미엄", "솔틴크래커", "1.36"], ["켄지", "파", "크래커", "15*42"], ["mars", "체다치즈", "크래커", "867"], ["커피", "누가크래커", "198*2"],
#                 ["로아커", "웨하스믹스", "800"], ["퀘이커", "그래놀라", "시리얼", "1125"], ["커클랜드", "피넛버터", "프레첼", "1.56"], ["슐츠", "프레첼", "1.56"], ["두보식품", "서리태스낵", "650"], ["오리온", "오징어땅콩콤보", "6"],
#                 ["맥스봉", "치즈플러스", "40*27"], ["청정원", "고구마츄", "90*5"], ["cj","맛밤", "42*17"], ["화과방", "영양갱", "40*40"], ["삼립", "약과", "1.5"], ["신화당", "종합전병", "918"], ["오리온", "초코파이", "39*72"],
#                 ["오리온", "카스타드", "48"], ["jaquet", "브라우니믹스", "150*5"], ["프레디", "피네스케이크", "39*80"], ["프레디", "스트로베리", "요거트","25*80"], ["켄지", "프레쉬", "버터파이", "720"], ["poult", "타르트", "900"],
#                 ["밀레폴리", "페스트리", "25*40"], ["오레오", "쿠키", "50*30"], ["마늘빵집", "갈릭", "바게뜨", "100*6"], ["네이처프렌드", "체다", "까망베르", "60*20"], ["켄지", "고프레", "바닐라", "초코", "630"],
#                 ["페퍼리지", "밀라노", "다크", "425"], ["라메르풀라", "쿠키", "틴", "750"], ["포피스", "카라멜라이즈", "쿠키", "300"], ["비첸지", "쿠키", "컬렉션", "907"], ["커클랜드", "벨기에", "쿠키", "1.4"], ["커클랜드", "허니머스타드", "스낵" ,"850"],
#                 ["오리온", "프로틴바", "미니", "594"], ["로카", "치즈", "비스킷", "580"], ["네이처밸리", "프로틴바", "1.2"], ["유기농", "현미강정", "125*4"], [""""""],





#크롤러 함수 crawler_data_for_coupang(크롤링 할 요소, 인덱스, 페이지):
def crawler_data_for_coupang(Element, index, page):

    t_find_delivery_return = []
    t_find_name = []
    t_find_price = []

    select_title = ""
    select_price = ""
    find_delivery = ""
    select_url = f"https://www.coupang.com/np/search?q={Element[index]}&channel=user&component=&eventCategory=SRP&trcid=&traid=&sorter=salePriceAsc&minPrice=&maxPrice=&priceRange=&filterType=&listSize=36&filter=&isPriceRange=false&brand=&offerCondition=&rating=0&page={page}&rocketAll=false&searchIndexingToken=&backgroundColor="
    data = { 'user-agent': 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/91.0.4472.77 Safari/537.36'}
    request = requests.get(select_url, headers=data, timeout = 10, verify=False)
    soup = BeautifulSoup(request.text, "html.parser")

    # 이렇게 찾으면 깔끔하게 다 찾아줌
    select_rocket = soup.find_all("li", {"class": "search-product"})

    #물품의 링크를 다 찾는다.
    find_url_temp = soup.find_all("a", {"class": "search-product-link"})

    # 배송 처리
    # print(select_rocket[11].find("span", {"class" : "badge rocket"}))
    t_find_url = []

    for i in range(len(select_rocket)):
        try:
            check_rocket = None
            check_global = None
            check_rocket = select_rocket[i].find("span", {"class": "badge rocket"})

            check_global = select_rocket[i].find("span", {"class": "badge global"})
            parse_url = select_rocket[i].find("a", {"class": "search-product-link"})["href"]

            if check_rocket == None and check_global == None:

                t_find_url.append("https://www.coupang.com" + parse_url)
            else:
                t_find_url.append("None")

            # .find("span", {"class" : "badge rocket"})
        except:
            pass

    #찾은 페이지의 로켓, 직구를 제외한 상품들의 안에 들어가서 가격, 배송비를 뽑아온다.
    for url in t_find_url:
        if url != "None":
            select_url = url
            data = {
                'user-agent': 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/91.0.4472.77 Safari/537.36'}
            request = requests.get(select_url, headers=data, timeout = 10, verify=False)
            soup = BeautifulSoup(request.text, "html.parser")

            select_title = soup.find("h2", {"class": "prod-buy-header__title"})
            select_price = soup.find("span", {"class": "total-price"})
            find_delivery = soup.find("div", {"class": "prod-shipping-fee-message"})
            # len 이 에러나면 링크는 있지만품절 상품이다. 품절 상품은 젤 뒤에 있으니 for문을 끝낸다
            try:
                a,b,c = len(select_title), len(select_price), len(find_delivery)
            except:
                print("품절 상품입니다.")
                break
            #배송비 문자열 슬라이싱


            temp = find_delivery.text.replace("\n", "")
            if temp == "무료배송":
                temp_delivery = "무료배송"
                t_find_delivery_return.append(temp_delivery)

            else:

                temp_delivery = ""
                for i in range(len(temp) - 1, -1, -1):
                    temp_delivery += temp[i]
                    if temp[i] == " ":
                        break
                temp_delivery = temp_delivery[::-1]
                # temp_delivery.replace(",", "")[:-1]
                if temp_delivery.replace(",", "").replace("원", "").strip() == "알아보기":
                    t_find_delivery_return.append("무료배송")

                else:
                    t_find_delivery_return.append(temp_delivery.replace(",", "").replace("원", "").strip())

            t_find_name.append(select_title.text.replace("\n", ""))
            t_find_price.append(select_price.text.replace("\n", "").replace("원", "").replace(",", ""))

    def remove_values_from_list(the_list, val):
        return [value for value in the_list if value != val]


    t_find_url = remove_values_from_list(t_find_url, 'None')


    return t_find_name, t_find_price, t_find_url, t_find_delivery_return


# 인자로 input 리스트를 받는다
def select_data(category_n, name_check):
    return_list = []
    check_flag = True

    index_check_num = -1
    print(category_n)
    #n번째 카테고리의 Elemnet
    for Element in category_n:

        index_check_num += 1
        min_value = 9999999999
        flag = -1

        #index는 Element의 0번째, 1번째 요소를 보기 위함 ['프렌치카페카페믹스', '프렌치카페카페믹스 190*2', 32990] 여기서 '프렌치, 프렌치카페믹스로 된 결과값
        for index in range(1,2):
            print("==============", Element[index],"를 검색합니다.================")
            print("==============", Element[2], "원을 원합니다. 검색합니다.================")
            print("\n\n")
            # 원하는 페이지 수 1page부터 ~까지  page수를 동적으로 해야할 것 같은데 or try, except
            for page in range(1, 10):

                # 크롤러 작동
                find_name, find_price, find_url, find_delivery = crawler_data_for_coupang(Element, index, page)
                print(find_name)
                print(find_price)
                print(find_url)
                print(len(find_name))
                print(len(find_price))
                print(len(find_url))

                #찾은 제품을 순회한다. #여기서 인덱스 해결해야함
                for i in range(len(find_name)):

                    for k in range(len(bread_mannual_keyword[index_check_num])):
                        if bread_mannual_keyword [index_check_num][k] not in str(find_name[i]):
                            print("제품명 출력 : ", find_name[i])
                            print("배송비 출력 : ", find_delivery[i])
                            print("가격 출력 : ", find_price[i])
                            print("url 출력 : ", find_url[i])
                            print("'"+bread_mannual_keyword[index_check_num][k] +"'" ,"키워드가 들어가는 제품이 아닙니다 !")
                            print("\n\n")

                            check_flag = False
                            break

                    if check_flag == False:
                        check_flag = True
                        continue
                    
                    #임시로 배송비와 가격을 더하는 부분
                    try:
                        price_plus_delivery = int(find_price[i])
                        print("제품명 출력 : ", find_name[i])
                        print("배송비 출력 : ",find_delivery[i])
                        print("가격 출력 : ",find_price[i])
                        print("url 출력 : ",find_url[i])
                        if find_delivery[i] != "무료배송":
                            price_plus_delivery += int(find_delivery[i])
                        print("배송비 + 가격 출력: ", price_plus_delivery)
                        print("비교할 가격은 : ", Element[2])



                        #연속 두번 같은값이 들어가는게 여기를 만족하는 제품이 없어서 , !!!
                        if min_value > price_plus_delivery and price_plus_delivery > Element[2] - int(Element[2] * 0.3):
                            min_value = price_plus_delivery
                            flag = i
                            temp_find_price = find_price[:]
                            temp_find_url = find_url[:]
                            temp_find_delivery = find_delivery[:]
                            print("가격대가 맞습니다. 저장합니다.")
                            print("\n\n")
                        else:
                            print("가격대가 맞지 않습니다.")
                            print("\n\n")
                    except:
                        continue
        # 가격 젤 낮은 것 입력
        if flag == -1:
            print("제품이 존재하지 않습니다.", "제품이 존재하지 않습니다.", "제품이 존재하지 않습니다.")
            return_list.append(["제품이 존재하지 않습니다.", "제품이 존재하지 않습니다.", "제품이 존재하지 않습니다."])

        else:
            print(temp_find_price[flag], temp_find_delivery[flag], temp_find_url[flag], "를 추가합니다. !!!!!!!!!!!!!!!!!!!!!!!!" )
            return_list.append([temp_find_price[flag], temp_find_delivery[flag], temp_find_url[flag] ])

    return return_list